# 데이터 랭글링

In [6]:
import pandas as pd

In [11]:
dataframe = pd.DataFrame()

In [12]:
dataframe['Name']= ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38,25]
dataframe['Driver']=[True, False]

In [13]:
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [14]:
new_person = pd.Series(['Molly Mooney', 40, True],
                      index = ['Name','Age','Driver'])

In [15]:
dataframe.append(new_person, ignore_index = True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [17]:
import numpy as np
data =[['Jacky Jackson',38,True],['Steven Stevenson', 25,False]]

matrix = np.array(data)

In [18]:
pd.DataFrame(matrix, columns =['Name','Age','Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [19]:
pd.DataFrame(data, columns =['Name','Ages','Driver'])

               Name  Ages  Driver
0     Jacky Jackson    38    True
1  Steven Stevenson    25   False

In [21]:
data = {'Name' : ['Jacky Jackson', 'Steven Stevenson'],
       'Age': [38,25],
       'Driver': [True, False]}

pd.DataFrame(data)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [24]:
url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url,error_bad_lines=False)

dataframe.head()

b'Skipping line 22: expected 1 fields, saw 7\nSkipping line 23: expected 1 fields, saw 2\nSkipping line 25: expected 1 fields, saw 3\nSkipping line 26: expected 1 fields, saw 3\nSkipping line 27: expected 1 fields, saw 2\nSkipping line 28: expected 1 fields, saw 2\nSkipping line 38: expected 1 fields, saw 5\nSkipping line 44: expected 1 fields, saw 2\nSkipping line 53: expected 1 fields, saw 2\nSkipping line 54: expected 1 fields, saw 5\nSkipping line 65: expected 1 fields, saw 2\nSkipping line 71: expected 1 fields, saw 2\nSkipping line 114: expected 1 fields, saw 2\nSkipping line 134: expected 1 fields, saw 2\nSkipping line 135: expected 1 fields, saw 2\nSkipping line 145: expected 1 fields, saw 2\n'

                                     <!DOCTYPE html>
0                                             <html>
1                                             <head>
2  \t<title>TinyURL.com - shorten that long URL i...
3               \t<base href="https://tinyurl.com/">
4  \t<meta name="google-site-verification" conten...

In [25]:
#datafrmae.iloc[0] #첫 번째 행을 선택

#dataframe.iloc[:4] #네 개의 행을 선택

#dataframe = dataframe.set_index(dataframe['Name']) #Name으로 인덱스를 설정

#datafrmae.loc['Allen, Miss Elisabeth Walton']

### loc은 인덱스가 레이블(문자열)일 떄 사용
### iloc은 인덱스가 정수일 때 사용

In [26]:
#dataframe.loc[:'Allison, Miss Helen Loraine', 'Age':'Sex']

#아래는 dataframe[:2]와 동일하다.

#dataframe[:'Allison, Miss Heleln Loraine']

#dataframe[['Age','Sex']].head(2)

## 조건에 따라 행 선택하기

In [27]:
#dataframe[datafrme['sex']=='female'].head(2)

#dataframe[(dataframe['sex']=='female' )&(dataframe['Age'] >=65) ]

## 값 치환하기

In [29]:
#dataframe['Sex'].replace('female','Woman').head(2)

#dataframe['Sex'].replace(['female','male'],['Woman','man']).head(5)

In [30]:
#dataframe.replace(1,'one').head(2)

#dataframe.replace(r'1st','First',regex = True).head(2)

#dataframe.replace(['female','male'],'person').head(3)

#dataframe.replace({'female : 1','male': 0}).head(3)

## 열 이름 바꾸기

In [32]:
dataframe.rename(columns ={'PClass' : 'Passenger Class'}).head(2)

dataframe.rename(columns = {'PClass' : 'Passenger Class', 'Sex':'Gender'}).head(2)

  <!DOCTYPE html>
0          <html>
1          <head>

In [33]:
import collections

In [36]:
column_names= collections.defaultdict(str)

In [37]:
for name in dataframe.columns :
    column_names[name]

In [38]:
column_names

defaultdict(str, {'<!DOCTYPE html>': ''})

### titanic.csv를 사용하는 예제는 읽기만 하고 넘어감

## 시간에 따라 행을 그루핑하기

In [41]:
import pandas as pd
import numpy as np

time_index = pd.date_range('06/06/2017', periods = 100000, freq = '30S')

dataframe = pd.DataFrame(index = time_index)

dataframe['Sale_Amount'] = np.random.randint(1,10,100000)

In [42]:
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86663
2017-06-18       101018
2017-06-25       101010
2017-07-02       100810
2017-07-09       101035
2017-07-16        10186

In [44]:
dataframe.shape

(100000, 1)

In [46]:
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            6
2017-06-06 00:00:30            7
2017-06-06 00:01:00            4

In [47]:
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     5.015220
2017-06-25     5.010615
2017-07-09     5.006076
2017-07-23     4.897115

In [50]:
dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [51]:
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [52]:
dataframe.resample('MS').count()

            Sale_Amount
2017-06-01        72000
2017-07-01        28000

## 데이터프레임 연결하기

In [55]:
data_a = {'id' :['1','2','3'],
         'first' : ['Alex','Amy','Allen'],
         'last' : ['Anderson','Ackerman','Ali']}

dataframe_a= pd.DataFrame(data_a, columns =['id','first','last'])

In [56]:
data_b= {'id' :['4','5','6'],
         'first' : ['Billy','Brian','Bran'],
         'last' : ['Bonder','Black','Balwner']}

dataframe_b= pd.DataFrame(data_b, columns =['id','first','last'])

In [58]:
pd.concat([dataframe_a,dataframe_b],axis = 1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [59]:
row = pd.Series([10,'Chris','Chillon'], index =['id','first','last'])

dataframe_a.append(row, ignore_index = True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

In [63]:
employee_data = {'employee_id': ['1','2','3','4'],
                'name' : ['Amy Jones','Allen keys','Alice Bees','Time Horton']}

dataframe_employees = pd.DataFrame(employee_data,columns = ['employee_id','name'])

In [70]:
sales_data = {'employee_id' : ['3','4','5','6'],
             'total_sales' : [23456, 2512, 2345,1455]}

dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id','total_sales'])

In [71]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id         name  total_sales
0           3   Alice Bees        23456
1           4  Time Horton         2512

In [74]:
pd.merge(dataframe_employees,dataframe_sales, left_on = 'employee_id', right_on = 'employee_id')

  employee_id         name  total_sales
0           3   Alice Bees        23456
1           4  Time Horton         2512